# HO_GetNumHoistOrigin

## Description
Get the number of all Hoist Origin objects in the current document

```pascal
FUNCTION HO_GetNumHoistOrigin : LONGINT;
```

```python

def vs.HO_GetNumHoistOrigin():
    return LONGINT
```

## Version
Availability: from Vectorworks 2018
## Category
* Spotlight